app/Controllers/Admin.php

SELECT *
FROM `raza`
SELECT *
FROM `color`
SELECT *
FROM `dieta`
---
public function agregarMascota() {
    helper(['form', 'url']);
    $razaModel = model('RazaModel');
    $colorModel = model('ColorModel');
    $dietaModel = model('DietaModel');
    $data['razas'] = $razaModel->findAll();
    $data['colores'] = $colorModel->findAll();
    $data['dietas'] = $dietaModel->findAll();

SELECT *
FROM `color`
SELECT *
FROM `raza`
---
     public function editarMascota($id){
        $mascotaModel = model('MascotaModel');
        $colorModel = model('ColorModel');
        $razaModel = model('RazaModel');

        $data['mascota'] = $mascotaModel->find($id);
$data['colores'] = $colorModel->findAll();
$data['razas'] = $razaModel->findAll();

UPDATE `mascota` SET `idRaza` = '5', `idColor` = '5', `edad` = '3', `descripcion` = 'Jugueton', `sexo` = 'Hembra', `esterilizado` = '0', `status` = '0'
WHERE `mascota`.`idMascota` IN ('1')
---
            public function updateM(){
                $mascotaModel = model('MascotaModel');
                $data = [
                    "idRaza"=>$_POST['idRaza'],
                    "idColor"=>$_POST['idColor'],
                    "edad" => $_POST['edad'],
                    "descripcion"=>$_POST['descripcion'],
                    "sexo"=>$_POST['sexo'],
                    "esterilizado"=>$_POST['esterilizado'],
                    "status"=>$_POST['status']
                ];

                $mascotaModel ->update( $_POST['idMascota'],$data);