app/Controllers/User.php

public function mostrarD(){
    $dietaModel = model('DietaModel');

    $data['dietas'] = $dietaModel->findAll();
---
SELECT *
FROM `dieta`

    public function estadisticas() {

        $mascotaModel = model('MascotaModel');

        $data['mascotas'] = $mascotaModel->findAll();
        $mascotaModel = model('MascotaModel');
        $adoptadas = $mascotaModel->where('status', 1)->countAllResults();
        $noAdoptadas = $mascotaModel->where('status', 0)->countAllResults();

        // Contar el total de mascotas
        $totalMascotas = $mascotaModel->countAll();
---
SELECT *
FROM `mascota`
SELECT COUNT(*) AS `numrows`
FROM `mascota`
WHERE `status` = 1
SELECT COUNT(*) AS `numrows`
FROM `mascota`
WHERE `status` = 0
SELECT COUNT(*) AS `numrows` FROM `mascota`